Revit 2026 API

# FamilySource Enumeration

---

Describes which version of the family to be loaded.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FamilySource
```
```vb
Public Enumeration FamilySource
```
```cpp
public enum class FamilySource
```
```fsharp
type FamilySource
```

| Member name | Value | Description |
| --- | --- | --- |
| Family | 1 | Loading the family from current family document. |
| Project | 0 | Loading the family from target project document. |

#### Reference

Autodesk.Revit.DB Namespace